app/controllers/actors_controller.rb

  def index
    @actors = Actor.all
---
SELECT "actors".* FROM "actors"

  def create
    @actor = Actor.new(actor_params)

    respond_to do |format|
      if @actor.save
---
INSERT INTO "actors" ("name", "age", "famous_movies", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

    def set_actor
      @actor = Actor.find(params[:id])
---
SELECT  "actors".* FROM "actors" WHERE "actors"."id" = ? LIMIT 1  [["id", 1]]