app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "description", "cast", "release_year", "genre", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

UPDATE "movies" SET "image_url" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["image_url", "matrix.jpeg"], ["updated_at", "2015-11-18 13:24:24.116642"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @movie.update(movie_params)